## Top 10 arrival airports in the world in 2013 (using the bookings file)

Arrival airport is the column arr_port. It is the IATA code for the airport

To get the total number of passengers for an airport, you can sum the column pax, grouping by arr_port.

Note that there is negative pax. That corresponds to cancelations. So to get the total number of passengers that have actually booked, you should sum including the negatives (that will remove the canceled bookings).

Print the top 10 arrival airports in the standard output, including the number of passengers.

Bonus point: Get the name of the city or airport corresponding to that airport (programatically, we suggest to have a look at GeoBases in Github)

Bonus point: Solve this problem using pandas (instead of any other approach)

Get familiar with data
Select the columns of interest
What to do with NaN?

Make action plan
Develop the code that works with a sample

Adjust the code to work with Big data
Test big data approach on a sample

Run program with big data

(Bonus Point)

## 0) Prepare booking Sample (we might need this for later)

In [ ]:
#done in ch_01

## 1) Get familiar with data

### What if we dont want to read the whole file?

Options:
1) prepare the sample
2) read_csv with nrows option

In [4]:
import pandas as pd

In [22]:
#DON'T DO THIS!!!
b = pd.read_csv('bookings.csv.bz2',sep='^')

In [5]:
cd ~/Data/challenge

/home/dsc/Data/challenge

In [9]:
b = pd.read_csv('bookings.sample.csv.bz2',sep='^')

In [8]:
#We can do it with nrows also
b = pd.read_csv('bookings.csv.bz2',sep='^', nrows=10000)

## Commands for obtaining data info:

Commands for obtaining data info:
    b.shape  - object 
    b.info()

    b.columns
    b.columns.to_list()
    list(b.columns)
    
    b.head() -function
    b.sample()
    
    #pd.set_option('display.max_columns', 100)
    pd.set_option('display.max_columns', None)
    
    b.describe()
    b.describe(include='all')
    df.dtypes
    
    b.isnull().sum()
    non_null_counts = b.count()

In [11]:
b.sample(5)

,act_date,source,pos_ctry,pos_iata,pos_oid,rloc,cre_date,duration,distance,dep_port,...,route,carrier,bkg_class,cab_class,brd_time,off_time,pax,year,month,oid
9845,2013-03-24 00:00:00,1V,CA,a6275f6fc9a6e1d7e58fa222b3f56c09,a4ad0c23a05a1117442fbf85a3f35ce8,a04d981e74ae0d69895a256f94afbe81,2012-11-21 00:00:00,24440,0,YYZ,...,LHRYYZ,LK,O,Y,2013-04-14 16:20:00,2013-04-14 18:50:34,-2,2013,3,NULL
1172,2013-03-06 00:00:00,1P,US,4804033f441ee30d92980c8b2207e8ae,4868da7a1666bbbc5fe33d377690f8eb,0eae498bb0bccdd1b46083e14b8927a7,2013-03-06 00:00:00,57699,0,JFK,...,JFKCDGATH,NV,T,Y,2013-04-18 19:10:00,2013-04-19 14:06:45,1,2013,3,NULL
1144,2013-03-18 00:00:00,1A,FR,4f1abfcca038fe7440b7ed6d1a853ae0,2f77e0895d7ef7381e677d44ee8cf27c,71fc9d7c609a1d0114fedcaff7c372ee,2013-03-12 00:00:00,14813,1191,GVA,...,CDGDUB,KP,W,Y,2013-04-30 15:40:00,2013-04-30 16:23:22,-1,2013,3,NULL
4568,2013-03-11 00:00:00,1A,FR,0518bcfa23df6fac8ccb13622f9eb070,7b02b710596f17e08624cac52b2ca4a4,425f249051d1801291cc1b4e23d7f8c6,2013-03-11 00:00:00,4357,0,MRS,...,ORYMRS,KP,A,F,2013-03-27 17:05:00,2013-03-27 18:37:17,1,2013,3,NULL
8457,2013-03-19 00:00:00,1V,CA,abc786fb31252b055357e232c1320e15,4789ba87da711de7c53fe2099e550d57,4106248403ce1a66792437982807db32,2013-03-19 00:00:00,3207,0,YYC,...,YYZYYC,HD,M,Y,2013-04-04 21:45:00,2013-04-04 23:42:42,2,2013,3,NULL

In [14]:
#pd.set_opti`on('display.max_columns', 100)
pd.set_option('display.max_columns', None)

In [16]:
b.sample(5)

,act_date,source,pos_ctry,pos_iata,pos_oid,rloc,cre_date,duration,distance,dep_port,dep_city,dep_ctry,arr_port,arr_city,arr_ctry,lst_port,lst_city,lst_ctry,brd_port,brd_city,brd_ctry,off_port,off_city,off_ctry,mkt_port,mkt_city,mkt_ctry,intl,route,carrier,bkg_class,cab_class,brd_time,off_time,pax,year,month,oid
106,2013-03-22 00:00:00,1P,US,83ccf07a55606976f78e63fcc805f58c,1490c3c5f95f04fa076fe15c775a80a9,8536b468b31a161141c397efaa8bad31,2013-03-22 00:00:00,4410,0,BOS,BOS,US,EWR,NYC,US,BOS,BOS,US,BOS,BOS,US,EWR,NYC,US,BOSEWR,BOSNYC,USUS,0,BOSEWR,FK,S,Y,2013-04-11 20:32:00,2013-04-11 21:42:47,1,2013,3,NULL
6084,2013-03-27 00:00:00,1V,US,75ad6fea47c9fd4ba9fb7a9aef158288,bfc7420e0ee050da4cb9aea6e8bbf8f8,860598506e233778dc6ddfe72f5c1a58,2013-03-20 00:00:00,2816,5727,LHR,LON,GB,KBL,KBL,AF,KBL,KBL,AF,LHR,LON,GB,ZRH,ZRH,CH,LHRZRH,LONZRH,CHGB,1,LHRZRH,LK,Y,Y,2013-08-14 07:10:00,2013-08-14 09:53:37,-1,2013,3,NULL
5353,2013-03-26 00:00:00,1P,LB,84a4aa8da388b27562ff92023f33b055,aca9cb4e20d6e92629e35dc524f9ef6d,5009f31e5f222ac555665908850fbce9,2013-03-25 00:00:00,87328,0,BEY,BEY,LB,JFK,NYC,US,BEY,BEY,LB,BEY,BEY,LB,JFK,NYC,US,BEYJFK,BEYNYC,LBUS,1,BEYLHRJFK,LK,N,Y,2013-04-24 06:15:00,2013-04-24 17:33:46,-2,2013,3,NULL
3799,2013-03-02 00:00:00,1S,IT,7b7dbb6f049f0691ca645b45932c89e4,4b355d4f966fcecd80b6df7a46924356,58287365967d183987ca9288caf621e1,2013-02-22 00:00:00,22782,0,FCO,ROM,IT,LAX,LAX,US,FCO,ROM,IT,FCO,ROM,IT,JFK,NYC,US,FCOJFK,NYCROM,ITUS,1,FCOMADJFK,KK,S,Y,2013-05-27 12:00:00,2013-05-27 18:24:23,-2,2013,3,NULL
302,2013-03-25 00:00:00,1P,LB,0b6690865ffb85eeafdf7ddf64678965,12d2c9b80ae7ae5713becd90938acbd4,bbb1867b7df2e79026d4ac474a332a83,2013-03-21 00:00:00,653,2781,BEY,BEY,LB,ADD,ADD,ET,ADD,ADD,ET,BEY,BEY,LB,ADD,ADD,ET,ADDBEY,ADDBEY,ETLB,1,BEYSAHADD,SJ,L,Y,2013-03-26 16:00:00,2013-03-27 03:53:44,-1,2013,3,NULL

In [10]:
b.describe()

            duration      distance         intl          pax    year   month
count    9999.000000   9999.000000  9999.000000  9999.000000  9999.0  9999.0
mean    20209.746075    455.608861     0.596260     0.516152  2013.0     3.0
std     42243.233482   1738.891068     0.490671     1.783970     0.0     0.0
min        59.000000      0.000000     0.000000   -25.000000  2013.0     3.0
25%      3339.000000      0.000000     0.000000    -1.000000  2013.0     3.0
50%      7721.000000      0.000000     1.000000     1.000000  2013.0     3.0
75%     19077.000000      0.000000     1.000000     1.000000  2013.0     3.0
max    488131.000000  18481.000000     1.000000    25.000000  2013.0     3.0

In [17]:
b.shape

(9999, 38)

In [19]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 38 columns):
act_date               9999 non-null object
source                 9999 non-null object
pos_ctry               9999 non-null object
pos_iata               9999 non-null object
pos_oid                9999 non-null object
rloc                   9999 non-null object
cre_date               9999 non-null object
duration               9999 non-null int64
distance               9999 non-null int64
dep_port               9999 non-null object
dep_city               9999 non-null object
dep_ctry               9999 non-null object
arr_port               9999 non-null object
arr_city               9999 non-null object
arr_ctry               9999 non-null object
lst_port               9999 non-null object
lst_city               9999 non-null object
lst_ctry               9999 non-null object
brd_port               9999 non-null object
brd_city               9999 non-null object
brd_ctry               9999 non-null object
off_port               9999 non-null object
off_city               9999 non-null object
off_ctry               9999 non-null object
mkt_port               9999 non-null object
mkt_city               9999 non-null object
mkt_ctry               9999 non-null object
intl                   9999 non-null int64
route                  9999 non-null object
carrier                9999 non-null object
bkg_class              9999 non-null object
cab_class              9999 non-null object
brd_time               9999 non-null object
off_time               9999 non-null object
pax                    9999 non-null int64
year                   9999 non-null int64
month                  9999 non-null int64
oid                    9999 non-null object
dtypes: int64(6), object(32)
memory usage: 2.9+ MB

In [20]:
b.columns

Index(['act_date           ', 'source', 'pos_ctry', 'pos_iata', 'pos_oid  ',
       'rloc          ', 'cre_date           ', 'duration', 'distance',
       'dep_port', 'dep_city', 'dep_ctry', 'arr_port', 'arr_city', 'arr_ctry',
       'lst_port', 'lst_city', 'lst_ctry', 'brd_port', 'brd_city', 'brd_ctry',
       'off_port', 'off_city', 'off_ctry', 'mkt_port', 'mkt_city', 'mkt_ctry',
       'intl', 'route          ', 'carrier', 'bkg_class', 'cab_class',
       'brd_time           ', 'off_time           ', 'pax', 'year', 'month',
       'oid      '],
      dtype='object')

In [22]:
#this is to see easily white spaces
list(b.columns)

['act_date           ',
 'source',
 'pos_ctry',
 'pos_iata',
 'pos_oid  ',
 'rloc          ',
 'cre_date           ',
 'duration',
 'distance',
 'dep_port',
 'dep_city',
 'dep_ctry',
 'arr_port',
 'arr_city',
 'arr_ctry',
 'lst_port',
 'lst_city',
 'lst_ctry',
 'brd_port',
 'brd_city',
 'brd_ctry',
 'off_port',
 'off_city',
 'off_ctry',
 'mkt_port',
 'mkt_city',
 'mkt_ctry',
 'intl',
 'route          ',
 'carrier',
 'bkg_class',
 'cab_class',
 'brd_time           ',
 'off_time           ',
 'pax',
 'year',
 'month',
 'oid      ']

## 2) Select the columns of interest

In [ ]:
arr_port, pax, year
drop NA

In [23]:
import pandas as pd
b = pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000)

## 3) What to do with NaN?

in the sample everything might be ok, but we should prepare fot NaN case

In [ ]:
b=b.dropna()

In [24]:
#dropna example
import numpy as np
data=np.random.rand(5,2)
df=pd.DataFrame(data, columns=['one', 'two'])

In [25]:
df

        one       two
0  0.250353  0.262417
1  0.680968  0.857296
2  0.922841  0.816704
3  0.544632  0.006420
4  0.722430  0.641729

In [26]:
df['three']=[None, None, 1, 1, None]

In [27]:
df

        one       two  three
0  0.250353  0.262417    NaN
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

In [133]:
#drop the row if it has at least NaN
df.dropna()

        one       two  three
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0

In [134]:
#drop the row if it has at least NaN
df.dropna(how='all')

        one       two  three
0  0.250353  0.262417    NaN
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

In [135]:
df["one"][0]="NaN"
df["two"][0]="NaN"
df.dropna(how='all')

        one       two  three
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

In [137]:
print (df)
df.dropna(how='any',axis=0)

        one       two  three
0       NaN       NaN    NaN
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

        one       two  three
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0

In [139]:
print (df)
df.dropna(how='any',axis=1)

        one       two  three
0       NaN       NaN    NaN
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

#### What if we want to drop just based on second column NaN?

In [140]:
df

        one       two  three
0       NaN       NaN    NaN
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

In [141]:
df['two'].isnull()

0     True
1    False
2    False
3    False
4    False
Name: two, dtype: bool

In [142]:
~df['two'].isnull()

0    False
1     True
2     True
3     True
4     True
Name: two, dtype: bool

In [143]:
df[~(df['two'].isnull())]

        one       two  three
1  0.680968  0.857296    NaN
2  0.922841  0.816704    1.0
3  0.544632  0.006420    1.0
4  0.722430  0.641729    NaN

## Ready to code

What do we have so far?

In [ ]:
import pandas as pd
b = pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000)
b=b.dropna()

## 4) make action plan

In [ ]:
0) filtrar por anho
00) optional: drop year

1)  group by arr_port
2) sum pax
3) ordenar y top 10

In [28]:
import pandas as pd
b = pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000)
b=b.dropna()

#### 4.1) Get only the booking from 2013

In [29]:
b=b[    b['year']==2013    ]

In [30]:
del b['year']

#### 4.2) group by arr_port

In [32]:
b_gr=b.groupby('arr_port')

In [39]:
b_gr.sum()

          pax
arr_port
AAL         0
ABQ        12
ABV         2
ABZ        -6
ACC         4
ADD         7
ADZ         2
AEP         7
AER         1
AES         3
AFA         2
AGA         0
AGP         8
AGU         4
AGX         2
AJA         7
AJF         2
AKL         2
ALA         6
ALB         2
ALC         9
ALG        26
AMD         2
AMM        16
AMS        36
ANC         4
ANF         2
ANU         0
AOE         1
AOI         0
...       ...
XNB         2
XQP         2
YAY        -2
YCD         3
YEG        15
YHD        -1
YHZ         4
YMM         0
YNB         0
YOW         0
YQM         0
YQQ         2
YQT         1
YQU         1
YTM         4
YUL        14
YVO         1
YVR        17
YWG         6
YXE         1
YXS         2
YXY         1
YYC        15
YYJ         3
YYZ        34
YZF         4
ZAG        -4
ZNZ         1
ZRH        16
ZYL        -1

[663 rows x 1 columns]

In [ ]:
b_gr['pax'].sum() #--> this is Serie

In [41]:
b_gr.sum().sort_values('pax', ascending=False).head(10)

          pax
arr_port
HKG       112
LGA        95
ORD        94
JFK        92
LAX        91
SFO        91
MCO        90
DCA        82
DEN        79
LHR        76

In [42]:
b.groupby('arr_port').sum().sort_values('pax', ascending=False).head(10)

          pax
arr_port
HKG       112
LGA        95
ORD        94
JFK        92
LAX        91
SFO        91
MCO        90
DCA        82
DEN        79
LHR        76

## 5) Adjust the code to work with Big data

What do we have so far?

In [43]:
import pandas as pd
b = pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000)
b=b.dropna()
b=b[    b['year']==2013    ]
del b['year']
top_10=b.groupby('arr_port').sum().sort_values('pax', ascending=False).head(10)

In [44]:
top_10

          pax
arr_port
HKG       112
LGA        95
ORD        94
JFK        92
LAX        91
SFO        91
MCO        90
DCA        82
DEN        79
LHR        76

#### but... we have to read the whole file... and with nrows we are reading ALWAYS the first N rows...

Option for reading the file:
    1) iterator=true and get_chunk
    2) define chunk_size

#### 1) iterator=true and get_chunk

In [45]:
b = pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000)

In [46]:
type(b)

pandas.core.frame.DataFrame

In [60]:
bc=pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000, iterator=True)

In [54]:
type(bc)

pandas.io.parsers.TextFileReader

In [61]:
b0=bc.get_chunk(6000)

In [62]:
type(b0)

pandas.core.frame.DataFrame

In [57]:
b0.shape

(6000, 3)

In [63]:
b1=bc.get_chunk(499000000)

In [64]:
b1.shape

(4000, 3)

In [65]:
#get_chunk fails when it has nothing ti return
b2=bc.get_chunk(1)

StopIteration:

#### 2) define chunk size

In [78]:
bc=pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000, chunksize=3000)

In [79]:
#we can still use get_chunk even though we defined the default chunk size
#b0=bc.get_chunk(6000)

#### How do we get the all the results of all chunks at one place?

In [ ]:
Options:
    1) df.append()
    2) df.concat()
    
    3) list of small DF and then concatenate them in one DF
    4) dictionary of airports
    5) ?

We will do the append option

In [88]:
import pandas as pd

bc=pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], nrows=10000, chunksize=3000)

all_chunks=pd.DataFrame()

for i, chunk in enumerate(bc):
    b=chunk.dropna()
    b=b[    b['year']==2013    ]
    del b['year']
    small_chunk_result=b.groupby('arr_port').sum()
    all_chunks=all_chunks.append(small_chunk_result)
    
all_chunks.groupby('arr_port').sum().sort_values('pax', ascending=False).head(10)

          pax
arr_port
HKG       112
LGA        95
ORD        94
JFK        92
LAX        91
SFO        91
MCO        90
DCA        82
DEN        79
LHR        76

## Pre-Bonus Solution

In [89]:
%%time
import pandas as pd

bc=pd.read_csv('bookings.csv.bz2',sep='^', usecols=['arr_port', 'pax', 'year'], chunksize=1000000)

all_chunks=pd.DataFrame()

for i, chunk in enumerate(bc):
    print (i)
    b=chunk.dropna()
    b=b[    b['year']==2013    ]
    del b['year']
    small_chunk_result=b.groupby('arr_port').sum()
    all_chunks=all_chunks.append(small_chunk_result)
    
    
top_airports=all_chunks.groupby('arr_port').sum().sort_values('pax', ascending=False)

0
1
2
3
4
5
6
7
8
9
10
CPU times: user 5min 5s, sys: 1.82 s, total: 5min 7s
Wall time: 5min 8s

In [90]:
top_airports.head()

              pax
arr_port
LHR       88809.0
MCO       70930.0
LAX       70530.0
LAS       69630.0
JFK       66270.0

### Now we've got top airports

we have to install geobases
pip install GeoBases

In [ ]:
#! pip install Geobases3k

In [94]:
from GeoBases import GeoBase

In [98]:
geoDict=GeoBase(data='ori_por', verbose=False)

In [97]:
geoDict.fields

['__key__',
 '__dup__',
 '__par__',
 '__lno__',
 'iata_code',
 'icao_code',
 'faa_code',
 'is_geonames',
 'geoname_id',
 'valid_id',
 'name',
 'asciiname',
 'lat',
 'lng',
 'fclass',
 'fcode',
 'page_rank',
 'date_from',
 'date_until',
 'comment',
 'country_code',
 'cc2',
 'country_name',
 'continent_name',
 'adm1_code',
 'adm1_name_utf',
 'adm1_name_ascii',
 'adm2_code',
 'adm2_name_utf',
 'adm2_name_ascii',
 'adm3_code',
 'adm4_code',
 'population',
 'elevation',
 'gtopo30',
 'timezone',
 'gmt_offset',
 'dst_offset',
 'raw_offset',
 'moddate',
 'city_code',
 'city_name_utf',
 'city_name_ascii',
 'tvl_por_list@raw',
 'tvl_por_list',
 'state_code',
 'location_type@raw',
 'location_type',
 'wiki_link',
 'alt_name_section@raw',
 'alt_name_section',
 '__gar__']

In [100]:
geoDict.get("LHR")['name']

'London Heathrow Airport'

In [116]:
geoDict.get("CPQ")

{'__dup__': ['CPQ@1'],
 '__gar__': [],
 '__key__': 'CPQ',
 '__lno__': 2416,
 '__par__': [],
 'adm1_code': '27',
 'adm1_name_ascii': 'Sao Paulo',
 'adm1_name_utf': 'SÃ£o Paulo',
 'adm2_code': '3509502',
 'adm2_name_ascii': 'Campinas',
 'adm2_name_utf': 'Campinas',
 'adm3_code': '',
 'adm4_code': '',
 'alt_name_section': (),
 'alt_name_section@raw': '',
 'asciiname': 'Amarais Airport',
 'cc2': '',
 'city_code': 'CPQ',
 'city_name_ascii': 'Campinas',
 'city_name_utf': 'Campinas',
 'comment': '',
 'continent_name': 'South America',
 'country_code': 'BR',
 'country_name': 'Brazil',
 'date_from': '',
 'date_until': '',
 'dst_offset': '-3.0',
 'elevation': '',
 'faa_code': '',
 'fclass': 'S',
 'fcode': 'AIRP',
 'geoname_id': '7730937',
 'gmt_offset': '-2.0',
 'gtopo30': '607',
 'iata_code': 'CPQ',
 'icao_code': 'SDAM',
 'is_geonames': 'Y',
 'lat': '-22.9',
 'lng': '-47.1',
 'location_type': ('A',),
 'location_type@raw': 'A',
 'moddate': '2012-08-03',
 'name': 'Amarais Airport',
 'page_rank': '',
 'population': '0',
 'raw_offset': '-3.0',
 'state_code': 'SP',
 'timezone': 'America/Sao_Paulo',
 'tvl_por_list': (),
 'tvl_por_list@raw': '',
 'valid_id': '',
 'wiki_link': ''}

In [108]:
top_airports.head()

              pax
arr_port
LHR       88809.0
MCO       70930.0
LAX       70530.0
LAS       69630.0
JFK       66270.0

In [107]:
top_airports.reset_index()['arr_port'][0]

'LHR     '

### How do we remove white spaces?

In [112]:
'jjhgj  kjkjhkhk       '.strip()

'jjhgj  kjkjhkhk'

### How do we put the name of each airport into the DF?

In [109]:
top_airports.reset_index(inplace=True)

In [111]:
top_airports.head()

   arr_port      pax
0  LHR       88809.0
1  MCO       70930.0
2  LAX       70530.0
3  LAS       69630.0
4  JFK       66270.0

In [113]:
top_airports['Airport Name']=top_airports['arr_port'].map(lambda x: geoDict.get( x.strip() )['name'] )

In [114]:
top_airports.head(10)

   arr_port      pax                          Airport Name
0  LHR       88809.0               London Heathrow Airport
1  MCO       70930.0         Orlando International Airport
2  LAX       70530.0     Los Angeles International Airport
3  LAS       69630.0       Mc Carran International Airport
4  JFK       66270.0  John F Kennedy International Airport
5  CDG       64490.0             Paris - Charles-de-Gaulle
6  BKK       59460.0                          Suvarnabhumi
7  MIA       58150.0           Miami International Airport
8  SFO       58000.0   San Francisco International Airport
9  DXB       55590.0           Dubai International Airport

## Final Solution

In [117]:
#removing the white space from arr_port column
top_airports['arr_port']=top_airports['arr_port'].map(lambda x: x.strip())

In [121]:
#Some have used Neobase and not Geobase for finding the name of the airport
#creating the DF withoug the CPQ airport as this airport code in not present in Neobase 
top_airports= top_airports[   top_airports['arr_port']!='CPQ'               ]

2273

In [118]:
top_airports

     arr_port      pax                                       Airport Name
0         LHR  88809.0                            London Heathrow Airport
1         MCO  70930.0                      Orlando International Airport
2         LAX  70530.0                  Los Angeles International Airport
3         LAS  69630.0                    Mc Carran International Airport
4         JFK  66270.0               John F Kennedy International Airport
5         CDG  64490.0                          Paris - Charles-de-Gaulle
6         BKK  59460.0                                       Suvarnabhumi
7         MIA  58150.0                        Miami International Airport
8         SFO  58000.0                San Francisco International Airport
9         DXB  55590.0                        Dubai International Airport
10        ORD  53200.0               Chicago O'Hare International Airport
11        FCO  45120.0                Leonardo da Vinciâ€“Fiumicino Airport
12        IST  43850.0                                 Istanbul / Ataturk
13        DFW  42420.0            Dallas/Fort Worth International Airport
14        CUN  42000.0                       CancÃºn International Airport
15        MAD  41410.0                                   Madrid / Barajas
16        BCN  41200.0                          Barcelonaâ€“El Prat Airport
17        LGA  40712.0                                 La Guardia Airport
18        ATL  39780.0  Hartsfield - Jackson Atlanta International Air...
19        EWR  36890.0                       Newark International Airport
20        BOS  35840.0  General Edward Lawrence Logan International Ai...
21        DEL  35680.0                                  New Delhi / Palam
22        SYD  33690.0                       Sydney International Airport
23        BOM  33440.0                                 Bombay / Santacruz
24        MUC  33180.0                       Munich International Airport
25        DEN  32630.0                       Denver International Airport
26        MNL  32400.0          Ninoy Aquino Manila International Airport
27        HKG  32020.0                    Hong Kong International Airport
28        FRA  31970.0                                  Frankfurt Airport
29        ORY  31800.0                                         Paris-Orly
...       ...      ...                                                ...
2244      IFN    -20.0                                            Esfahan
2245      LBF    -20.0       North Platte Regional Airport Lee Bird Field
2246      LEN    -20.0                           Leon / Virgen Del Camino
2247      XUZ    -20.0                             Xuzhou Guanyin Airport
2248      FLA    -20.0                 Gustavo Artunduaga Paredes Airport
2249      YRB    -20.0                                 Resolute, N. W. T.
2250      HDG    -20.0                                       Hebei Handan
2251      TAG    -20.0                                Tagbilaran Airfield
2252      HRI    -20.0                   Hambantota International Airport
2253      BER    -20.0                         Berlin Brandenburg Airport
2254      RRG    -20.0                                          Rodrigues
2255      KSN    -20.0                                   Kostanay Airport
2256      VDM    -20.0                Gobernador Edgardo Castello Airport
2257      CPQ    -20.0                                    Amarais Airport
2258      YCU    -20.0                          Yuncheng Guangong Airport
2259      BAV    -20.0                             Baotou Erliban Airport
2260      RXS    -30.0                                              Roxas
2261      CGD    -30.0                                    Changde Airport
2262      KKJ    -40.0                                 KitakyÅ«shÅ« Airport
2263      XNN    -40.0                           Xining Caojiabao Airport
2264      KUU    -40.0                               Kullu Manali Airport
2265      FLW    -50.0                                      Flores Acores
2266      MUA    -60.0                                              Munda
2267      CXR    -60.0                     Cam Ranh International Airport
2268      SDJ    -70.0                                     Sendai Airport
2269      MYJ    -80.0                                  Matsuyama Airport
2270      UPG    -90.0                         Ujung Pandang / Hasanuddin
2271      XWG    -90.0                      Strasbourg FR Railway Station
2272      MZV   -350.0                                       Mulu Airport
2273      AYQ  -1270.0                                         Ayers Rock

[2274 rows x 3 columns]

In [127]:
#saving the result in file which will be used in 5th exercise
top_airports.to_csv('top_airports.csv', sep='^', index=False)

In [128]:
ll

total 1014676
-rwxr-x--- 1 dsc 554970628 mar 13  2018 bookings.csv.bz2*
-rw-r--r-- 1 dsc    535893 feb  1 17:25 bookings.sample.csv.bz2
-rwxr-x--- 1 dsc 483188920 mar 13  2018 searches.csv.bz2*
-rw-r--r-- 1 dsc    244720 feb  1 17:32 searches.sample.csv.bz2
-rw-r--r-- 1 dsc     73326 feb  1 21:40 top_airports.csv

In [129]:
! head top_airports.csv

arr_port^pax^Airport Name
LHR^88809.0^London Heathrow Airport
MCO^70930.0^Orlando International Airport
LAX^70530.0^Los Angeles International Airport
LAS^69630.0^Mc Carran International Airport
JFK^66270.0^John F Kennedy International Airport
CDG^64490.0^Paris - Charles-de-Gaulle
BKK^59460.0^Suvarnabhumi
MIA^58150.0^Miami International Airport
SFO^58000.0^San Francisco International Airport

In [130]:
#transforming pax type from float to integer so that we dont have .0 in the csv
top_airports=top_airports.astype({'pax':int})

In [131]:
top_airports.to_csv('top_airports.csv', sep='^', index=False)

In [132]:
! head top_airports.csv

arr_port^pax^Airport Name
LHR^88809^London Heathrow Airport
MCO^70930^Orlando International Airport
LAX^70530^Los Angeles International Airport
LAS^69630^Mc Carran International Airport
JFK^66270^John F Kennedy International Airport
CDG^64490^Paris - Charles-de-Gaulle
BKK^59460^Suvarnabhumi
MIA^58150^Miami International Airport
SFO^58000^San Francisco International Airport